; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	satellite3 - satellite
	instrument9 - instrument
	satellite4 - satellite
	instrument10 - instrument
	thermograph0 - mode
	infrared1 - mode
	image2 - mode
	GroundStation1 - direction
	Star0 - direction
	Star2 - direction
	Phenomenon3 - direction
	Star4 - direction
	Planet5 - direction
	Planet6 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Star12 - direction
	Planet13 - direction
	Star14 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 image2)
	(calibration_target instrument0 Star0)
	(supports instrument1 infrared1)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 Star0)
	(supports instrument2 thermograph0)
	(supports instrument2 infrared1)
	(supports instrument2 image2)
	(calibration_target instrument2 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet6)
	(supports instrument3 thermograph0)
	(supports instrument3 image2)
	(supports instrument3 infrared1)
	(calibration_target instrument3 Star0)
	(supports instrument4 image2)
	(calibration_target instrument4 Star0)
	(supports instrument5 infrared1)
	(calibration_target instrument5 Star0)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon7)
	(supports instrument6 thermograph0)
	(supports instrument6 infrared1)
	(calibration_target instrument6 Star0)
	(supports instrument7 thermograph0)
	(calibration_target instrument7 Star2)
	(supports instrument8 image2)
	(calibration_target instrument8 Star0)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(on_board instrument8 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet8)
	(supports instrument9 thermograph0)
	(supports instrument9 image2)
	(supports instrument9 infrared1)
	(calibration_target instrument9 Star2)
	(on_board instrument9 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation1)
	(supports instrument10 image2)
	(supports instrument10 infrared1)
	(calibration_target instrument10 Star2)
	(on_board instrument10 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation1)
)
(:goal (and
	(pointing satellite0 Phenomenon10)
	(pointing satellite4 Star2)
	(have_image Phenomenon3 infrared1)
	(have_image Star4 infrared1)
	(have_image Planet5 image2)
	(have_image Planet6 infrared1)
	(have_image Phenomenon7 infrared1)
	(have_image Planet8 image2)
	(have_image Planet9 thermograph0)
	(have_image Phenomenon10 thermograph0)
	(have_image Planet11 infrared1)
	(have_image Star12 thermograph0)
	(have_image Planet13 thermograph0)
	(have_image Star14 infrared1)
))

)

; plan
1. (switch_on instrument10 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument10)
   goals met: 0 of 14
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 14
3. (turn_to satellite4 planet5 groundstation1)
   deleted: (pointing satellite4 groundstation1)
   added: (pointing satellite4 planet5)
   goals met: 0 of 14
4. (turn_to satellite4 star2 planet5)
   deleted: (pointing satellite4 planet5)
   added: (pointing satellite4 star2)
   goals met: 1 of 14
5. (calibrate satellite4 instrument10 star2)
   added: (calibrated instrument10)
   goals met: 1 of 14
6. (turn_to satellite0 phenomenon10 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 phenomenon10)
   goals met: 2 of 14
7. (turn_to satellite0 star0 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 star0)
   goals met: 1 of 14
8. (calibrate satellite0 instrument1 star0)
   added: (calibrated instrument1)
   goals met: 1 of 14
9. (turn_to satellite0 phenomenon10 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 phenomenon10)
   goals met: 2 of 14
10. (take_image satellite0 phenomenon10 instrument1 thermograph0)
   added: (have_image phenomenon10 thermograph0)
   goals met: 3 of 14
11. (turn_to satellite4 planet5 star2)
   deleted: (pointing satellite4 star2)
   added: (pointing satellite4 planet5)
   goals met: 2 of 14
12. (take_image satellite4 planet5 instrument10 image2)
   added: (have_image planet5 image2)
   goals met: 3 of 14
13. (turn_to satellite4 phenomenon3 planet5)
   deleted: (pointing satellite4 planet5)
   added: (pointing satellite4 phenomenon3)
   goals met: 3 of 14
14. (take_image satellite4 phenomenon3 instrument10 infrared1)
   added: (have_image phenomenon3 infrared1)
   goals met: 4 of 14
15. (turn_to satellite4 phenomenon7 phenomenon3)
   deleted: (pointing satellite4 phenomenon3)
   added: (pointing satellite4 phenomenon7)
   goals met: 4 of 14
16. (take_image satellite4 phenomenon7 instrument10 infrared1)
   added: (have_image phenomenon7 infrared1)
   goals met: 5 of 14
17. (turn_to satellite4 planet11 phenomenon7)
   deleted: (pointing satellite4 phenomenon7)
   added: (pointing satellite4 planet11)
   goals met: 5 of 14
18. (take_image satellite4 planet11 instrument10 infrared1)
   added: (have_image planet11 infrared1)
   goals met: 6 of 14
19. (turn_to satellite4 planet6 planet11)
   deleted: (pointing satellite4 planet11)
   added: (pointing satellite4 planet6)
   goals met: 6 of 14
20. (take_image satellite4 planet6 instrument10 infrared1)
   added: (have_image planet6 infrared1)
   goals met: 7 of 14
21. (turn_to satellite4 planet8 planet6)
   deleted: (pointing satellite4 planet6)
   added: (pointing satellite4 planet8)
   goals met: 7 of 14
22. (take_image satellite4 planet8 instrument10 image2)
   added: (have_image planet8 image2)
   goals met: 8 of 14
23. (turn_to satellite4 star14 planet8)
   deleted: (pointing satellite4 planet8)
   added: (pointing satellite4 star14)
   goals met: 8 of 14
24. (take_image satellite4 star14 instrument10 infrared1)
   added: (have_image star14 infrared1)
   goals met: 9 of 14
25. (turn_to satellite4 star2 star14)
   deleted: (pointing satellite4 star14)
   added: (pointing satellite4 star2)
   goals met: 10 of 14
26. (turn_to satellite4 star4 star2)
   deleted: (pointing satellite4 star2)
   added: (pointing satellite4 star4)
   goals met: 9 of 14
27. (take_image satellite4 star4 instrument10 infrared1)
   added: (have_image star4 infrared1)
   goals met: 10 of 14
28. (turn_to satellite4 star2 star4)
   deleted: (pointing satellite4 star4)
   added: (pointing satellite4 star2)
   goals met: 11 of 14
29. (turn_to satellite0 planet13 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 planet13)
   goals met: 10 of 14
30. (take_image satellite0 planet13 instrument1 thermograph0)
   added: (have_image planet13 thermograph0)
   goals met: 11 of 14
31. (turn_to satellite0 phenomenon10 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 phenomenon10)
   goals met: 12 of 14
32. (turn_to satellite0 planet9 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 planet9)
   goals met: 11 of 14
33. (take_image satellite0 planet9 instrument1 thermograph0)
   added: (have_image planet9 thermograph0)
   goals met: 12 of 14
34. (turn_to satellite0 phenomenon10 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 phenomenon10)
   goals met: 13 of 14
35. (turn_to satellite0 star12 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 star12)
   goals met: 12 of 14
36. (take_image satellite0 star12 instrument1 thermograph0)
   added: (have_image star12 thermograph0)
   goals met: 13 of 14
37. (turn_to satellite0 phenomenon10 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 phenomenon10)
   goals met: 14 of 14
